In [1]:
import numpy as np
import pandas as pd

In [2]:
ser = pd.Series(np.random.randn(4), index=['a', 'b', 'c', 'd'])
ser

a   -2.462334
b   -1.152108
c    0.165155
d   -1.370438
dtype: float64

In [3]:
ser.values

array([-2.46233357, -1.15210769,  0.16515482, -1.37043821])

In [4]:
ser.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [5]:
da = {'seoul' : 2000, 'busan' : 2500, 'daejeon' : 3000}

In [6]:
pd.Series(da)

seoul      2000
busan      2500
daejeon    3000
dtype: int64

In [7]:
da = {'a' : 0., 'b' : 1., 'c' : 2.}

In [8]:
pd.Series(da)

a    0.0
b    1.0
c    2.0
dtype: float64

In [9]:
pd.Series(da, index=['b', 'c', 'd', 'a'])

b    1.0
c    2.0
d    NaN
a    0.0
dtype: float64

In [10]:
pd.Series(7., index=['a', 'b', 'c'])

a    7.0
b    7.0
c    7.0
dtype: float64

In [11]:
ser[0]

-2.4623335680922405

In [12]:
ser[:3]

a   -2.462334
b   -1.152108
c    0.165155
dtype: float64

In [13]:
np.exp(ser)

a    0.085236
b    0.315970
c    1.179576
d    0.253996
dtype: float64

In [14]:
ser['a']

-2.4623335680922405

In [15]:
ser['d'] = 7.

In [16]:
ser

a   -2.462334
b   -1.152108
c    0.165155
d    7.000000
dtype: float64

In [17]:
ser + ser

a    -4.924667
b    -2.304215
c     0.330310
d    14.000000
dtype: float64

In [18]:
ser * 2

a    -4.924667
b    -2.304215
c     0.330310
d    14.000000
dtype: float64

In [19]:
ser[1:] + ser[:-1]

a         NaN
b   -2.304215
c    0.330310
d         NaN
dtype: float64

In [20]:
ser = pd.Series(np.random.randn(5), name='seoul')
ser

0    0.928059
1    1.353727
2   -0.340133
3    0.069274
4   -0.816523
Name: seoul, dtype: float64

In [21]:
ser1 = ser.rename("busan")

In [22]:
ser1.name

'busan'

In [23]:
d = {'one': pd.Series([1., 2., 3.], index=['a', 'b', 'c']),
'two': pd.Series([1., 2., 3., 4.], index=['a', 'b', 'c', 'd'])}

In [24]:
df = pd.DataFrame(d)
df

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

In [25]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, a to d
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   one     3 non-null      float64
 1   two     4 non-null      float64
dtypes: float64(2)
memory usage: 96.0+ bytes

In [26]:
df.dtypes

one    float64
two    float64
dtype: object

In [27]:
pd.DataFrame(d, index=['d', 'b', 'a'])

   one  two
d  NaN  4.0
b  2.0  2.0
a  1.0  1.0

In [28]:
pd.DataFrame(d, index=['d', 'b', 'a'], columns=['two', 'three'])

   two three
d  4.0   NaN
b  2.0   NaN
a  1.0   NaN

In [29]:
df.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [30]:
df.columns

Index(['one', 'two'], dtype='object')

In [31]:
d = {'one': [1., 2., 3.], 'two': [3., 2., 1.]}

In [32]:
pd.DataFrame(d)

   one  two
0  1.0  3.0
1  2.0  2.0
2  3.0  1.0

In [33]:
pd.DataFrame(d, index=['a', 'b', 'c'])

   one  two
a  1.0  3.0
b  2.0  2.0
c  3.0  1.0

In [34]:
arr = np.zeros((2,), dtype=[('A', 'i4'), ('B', 'f4'), ('C', 'a10')])

In [35]:
arr[:] = [(1, 2., 'Hello'), (2, 3., 'World')]

In [36]:
arr

array([(1, 2., b'Hello'), (2, 3., b'World')],
      dtype=[('A', '<i4'), ('B', '<f4'), ('C', 'S10')])

In [37]:
pd.DataFrame(arr)

   A    B         C
0  1  2.0  b'Hello'
1  2  3.0  b'World'

In [38]:
pd.DataFrame(arr, index=['first', 'second'])

        A    B         C
first   1  2.0  b'Hello'
second  2  3.0  b'World'

In [39]:
pd.DataFrame(arr, columns=['C', 'A', 'B'])

          C  A    B
0  b'Hello'  1  2.0
1  b'World'  2  3.0

In [40]:
data = [{'a': 1, 'b': 2}, {'a': 5, 'b': 10, 'c': 20}]

In [41]:
pd.DataFrame(data)

   a   b     c
0  1   2   NaN
1  5  10  20.0

In [42]:
pd.DataFrame(data, columns=['a', 'b'])

   a   b
0  1   2
1  5  10

In [43]:
pd.DataFrame({('a', 'b'): {('A', 'B'): 1, ('A', 'C'): 2},
('a', 'a'): {('A', 'C'): 3, ('A', 'B'): 4},
('a', 'c'): {('A', 'B'): 5, ('A', 'C'): 6},
('b', 'a'): {('A', 'C'): 7, ('A', 'B'): 8},
('b', 'b'): {('A', 'D'): 9, ('A', 'B'): 10}})

       a              b
       b    a    c    a     b
A B  1.0  4.0  5.0  8.0  10.0
  C  2.0  3.0  6.0  7.0   NaN
  D  NaN  NaN  NaN  NaN   9.0

In [44]:
dict([('A', [1, 2, 3]), ('B', [4, 5, 6])])

{'A': [1, 2, 3], 'B': [4, 5, 6]}

In [45]:
pd.DataFrame.from_dict(dict([('A', [1, 2, 3]), ('B', [4, 5, 6])]))

   A  B
0  1  4
1  2  5
2  3  6

In [46]:
pd.DataFrame.from_dict(dict([('A', [1, 2, 3]), ('B', [4, 5, 6])]), orient='index',
columns=['one', 'two', 'three'])

   one  two  three
A    1    2      3
B    4    5      6

In [47]:
arr

array([(1, 2., b'Hello'), (2, 3., b'World')],
      dtype=[('A', '<i4'), ('B', '<f4'), ('C', 'S10')])

In [48]:
pd.DataFrame.from_records(arr, index='C')

          A    B
C
b'Hello'  1  2.0
b'World'  2  3.0

In [49]:
df['one']

a    1.0
b    2.0
c    3.0
d    NaN
Name: one, dtype: float64

In [50]:
df['two']

a    1.0
b    2.0
c    3.0
d    4.0
Name: two, dtype: float64

In [51]:
df['three'] = df['one'] * df['two']
df['flag'] = df['one'] > 2
df

   one  two  three   flag
a  1.0  1.0    1.0  False
b  2.0  2.0    4.0  False
c  3.0  3.0    9.0   True
d  NaN  4.0    NaN  False

In [52]:
del df['two']
df.pop('three')

a    1.0
b    4.0
c    9.0
d    NaN
Name: three, dtype: float64

In [53]:
df

   one   flag
a  1.0  False
b  2.0  False
c  3.0   True
d  NaN  False

In [54]:
df['ha'] = 'hiho'
df

   one   flag    ha
a  1.0  False  hiho
b  2.0  False  hiho
c  3.0   True  hiho
d  NaN  False  hiho

In [55]:
df['trunced_one'] = df['one'][:2]
df

   one   flag    ha  trunced_one
a  1.0  False  hiho          1.0
b  2.0  False  hiho          2.0
c  3.0   True  hiho          NaN
d  NaN  False  hiho          NaN

In [56]:
df.insert(1, 'hi', df['one'])
df

   one   hi   flag    ha  trunced_one
a  1.0  1.0  False  hiho          1.0
b  2.0  2.0  False  hiho          2.0
c  3.0  3.0   True  hiho          NaN
d  NaN  NaN  False  hiho          NaN

In [57]:
ser = pd.Series(data=np.arange(3), index=['A', 'B', 'C'])
ser

A    0
B    1
C    2
dtype: int32

In [58]:
ser.drop(labels=['B', 'C'])

A    0
dtype: int32

In [59]:
df1= pd.DataFrame(np.arange(12).reshape(3, 4), columns=['A', 'B', 'C', 'D'])
df1

   A  B   C   D
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [60]:
df1.drop(['B', 'C'], axis=1)

   A   D
0  0   3
1  4   7
2  8  11

In [61]:
df1.drop([0, 1])

   A  B   C   D
2  8  9  10  11

In [62]:
df.loc['b']

one                2
hi                 2
flag           False
ha              hiho
trunced_one        2
Name: b, dtype: object

In [63]:
df.iloc[2]

one               3
hi                3
flag           True
ha             hiho
trunced_one     NaN
Name: c, dtype: object

In [64]:
df = pd.DataFrame(np.random.randn(5, 4), columns=['A', 'B', 'C', 'D'])
df2 = pd.DataFrame(np.random.randn(3, 3), columns=['A', 'B', 'C'])
df+df2

          A         B         C   D
0  0.270188 -0.396434  0.794156 NaN
1  1.672591  0.129014  0.597811 NaN
2  2.625965 -1.629937  1.775333 NaN
3       NaN       NaN       NaN NaN
4       NaN       NaN       NaN NaN

In [65]:
df - df.iloc[0]

          A         B         C         D
0  0.000000  0.000000  0.000000  0.000000
1  2.121900  0.860163 -0.326609  1.056635
2  1.574823 -0.288110 -0.440263  0.188779
3  2.029266  0.058574 -0.440267  1.572943
4 -0.876828  1.343589 -0.865059  0.259325

In [66]:
df * 10 + 2

           A         B          C          D
0  -6.355615 -4.289723  10.621515  -5.160652
1  14.863381  4.311908   7.355422   5.405699
2   9.392610 -7.170825   6.218886  -3.272861
3  13.937043 -3.703985   6.218843  10.568777
4 -15.123891  9.146163   1.970928  -2.567407

In [67]:
df1 = pd.DataFrame({'a': [1, 0, 1], 'b': [0, 1, 1]}, dtype=bool)
df2 = pd.DataFrame({'a': [0, 1, 1], 'b': [1, 1, 0]}, dtype=bool)
df1

       a      b
0   True  False
1  False   True
2   True   True

In [68]:
df2

       a      b
0  False   True
1   True   True
2   True  False

In [69]:
df1 & df2

       a      b
0  False  False
1  False   True
2   True  False

In [70]:
df1 | df2

      a     b
0  True  True
1  True  True
2  True  True

In [71]:
df1 ^ df2

       a      b
0   True   True
1   True  False
2  False   True

In [72]:
-df1

       a      b
0  False   True
1   True  False
2  False  False

In [73]:
df[:2]

          A         B         C         D
0 -0.835562 -0.628972  0.862151 -0.716065
1  1.286338  0.231191  0.535542  0.340570

In [74]:
df[:2].T

          0         1
A -0.835562  1.286338
B -0.628972  0.231191
C  0.862151  0.535542
D -0.716065  0.340570

In [75]:
df3 = pd.DataFrame(np.arange(12).reshape(3, 4), columns=['A', 'B', 'C', 'D'])
np.exp(df3)

             A            B             C             D
0     1.000000     2.718282      7.389056     20.085537
1    54.598150   148.413159    403.428793   1096.633158
2  2980.957987  8103.083928  22026.465795  59874.141715

In [76]:
np.asarray(df3)

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [ ]:
ind=pd.Index([1,3,5,7,9,11])
ind
ind[::2]
ind.ndim, ind.shape
ind[1]=6

In [ ]:
pd.Index([1,2,3])
pd.Index(list('abc'))

In [ ]:
df=pd.DataFrame(np.arnage(12).reshape(2,6), columns=list('ABCDEF'))
df
df.index

In [ ]:
ser=pd.Series(['ha', 'hi']*1000)
ser
ser.nbytes
ser.astype('category')
ser.astype('category').nbytes

In [ ]:
s1=pd.Categorical([1,2,3,1,2,3])
s1
type(s1)
s1.dtype
s2=pd.Categorical(['a, 'b', 'c', 'a', 'b', 'c'])
s2

In [ ]:
s3=pd.Categorical(['a', 'b', 'c', 'a', 'b,', 'c'], ordered=True, categories=['c', 'b', 'a'])
s3
s3.min(), s3.max()

In [77]:
ser = pd.Series(['a', 'b', 'c', 'a'], dtype='category')
ser

0    a
1    b
2    c
3    a
dtype: category
Categories (3, object): ['a', 'b', 'c']

In [78]:
df = pd.DataFrame({'A': ['a', 'b', 'c', 'a']})
df['B'] = df['A'].astype('category')
df

   A  B
0  a  a
1  b  b
2  c  c
3  a  a

In [79]:
df.dtypes

A      object
B    category
dtype: object

In [80]:
df = pd.DataFrame({'A': list('abca'), 'B': list('bccd')}, dtype='category')
df.dtypes

A    category
B    category
dtype: object

In [81]:
df['A']

0    a
1    b
2    c
3    a
Name: A, dtype: category
Categories (3, object): ['a', 'b', 'c']

In [82]:
df['B']

0    b
1    c
2    c
3    d
Name: B, dtype: category
Categories (3, object): ['b', 'c', 'd']

In [83]:
df = pd.DataFrame({'A': list('abca'), 'B': list('bccd')})
df_cat = df.astype('category')
df_cat.dtypes

A    category
B    category
dtype: object

In [84]:
arr = [[1, 1, 2, 2], ['red', 'blue', 'red', 'blue']]
pd.MultiIndex.from_arrays(arr, names=('number', 'color'))

MultiIndex([(1,  'red'),
            (1, 'blue'),
            (2,  'red'),
            (2, 'blue')],
           names=['number', 'color'])

In [85]:
arr=[['ha', 'ha', 'hi', 'hi', 'ho', 'ho',], ['one', 'two', 'one', 'two', 'one', 'two']]
tuples = list(zip(*arr))
tuples

[('ha', 'one'),
 ('ha', 'two'),
 ('hi', 'one'),
 ('hi', 'two'),
 ('ho', 'one'),
 ('ho', 'two')]

In [86]:
ind = pd.MultiIndex.from_tuples(tuples, names=['first', 'second'])
ind

MultiIndex([('ha', 'one'),
            ('ha', 'two'),
            ('hi', 'one'),
            ('hi', 'two'),
            ('ho', 'one'),
            ('ho', 'two')],
           names=['first', 'second'])

In [87]:
ser = pd.Series(np.random.randn(6), index=ind)
ser

first  second
ha     one      -2.190807
       two       0.842013
hi     one      -1.916039
       two       0.450694
ho     one      -0.501797
       two      -1.042649
dtype: float64

In [88]:
arr = [np.array(['ha', 'ha', 'hi', 'hi', 'ho', 'ho']),
np.array(['one','two','one','two','one','two'])]
ser = pd.Series(np.random.randn(6), index=arr)
ser

ha  one   -0.772656
    two   -0.222008
hi  one    1.022798
    two    0.345339
ho  one    1.194641
    two    2.200740
dtype: float64

In [89]:
df = pd.DataFrame(np.random.randn(6, 4), index=arr)
df

               0         1         2         3
ha one  0.333032  0.286146 -1.358321 -0.235383
   two  0.435700 -1.360301 -1.552782  0.641645
hi one -1.019732  0.820501 -0.494307  0.502008
   two -1.710146 -0.739259  0.735056  1.551888
ho one -1.272207  0.633182 -0.217229  0.866496
   two -0.408724  0.665195 -0.422924 -0.626811

In [90]:
df.index

MultiIndex([('ha', 'one'),
            ('ha', 'two'),
            ('hi', 'one'),
            ('hi', 'two'),
            ('ho', 'one'),
            ('ho', 'two')],
           )

In [91]:
df = pd.DataFrame(np.random.randn(3, 6), index=['A', 'B', 'C'], columns=ind)
df

first         ha                  hi                  ho
second       one       two       one       two       one       two
A      -0.199263  1.156855  0.782776 -0.477027 -0.312097 -1.291807
B      -0.143447  0.746046  0.098691  0.873773  0.050750  1.379966
C      -0.373708  0.006994  0.292504 -0.991027 -1.262709 -1.583805

In [92]:
pd.DataFrame(np.random.randn(3, 4), index=ind[:3], columns=ind[:4])

first               ha                  hi
second             one       two       one       two
first second
ha    one     0.750292  1.743748  0.487320 -0.622411
      two     1.057800  0.206822 -0.881181 -0.838981
hi    one    -0.130969 -0.730972  0.606049  2.038428

In [93]:
pd.Series(np.random.randn(6), index=tuples)

(ha, one)    0.511563
(ha, two)    0.962255
(hi, one)    1.821547
(hi, two)    0.458133
(ho, one)   -0.268066
(ho, two)    0.799290
dtype: float64

In [94]:
ser = pd.Series(np.random.randn(1000))
ser.head()

0    0.443884
1   -0.193001
2   -0.723272
3   -0.978074
4   -0.694863
dtype: float64

In [95]:
ser.tail(3)

997    0.121917
998   -1.024379
999    0.792218
dtype: float64

In [96]:
ind = pd.date_range('1/1/2021', periods=5)
ser = pd.Series(np.random.randn(5), index=['a', 'b', 'c', 'd', 'e'])
df = pd.DataFrame(np.random.randn(5, 3), index=ind, columns=['A', 'B', 'C'])
df[:2]

                   A         B         C
2021-01-01 -0.223117  0.686255 -0.206477
2021-01-02 -0.463381 -0.221826  0.607350

In [97]:
df = pd.DataFrame({'one': pd.Series(np.random.randn(2), index=['a','b']),
'two': pd.Series(np.random.randn(3), index=['a','b','c']),
'three': pd.Series(np.random.randn(2), index=['b','c'])})
df

        one       two     three
a -0.285103  0.605265       NaN
b  0.033046  1.532221  1.019538
c       NaN  0.780580  0.905003

In [98]:
df.iloc[1]

one      0.033046
two      1.532221
three    1.019538
Name: b, dtype: float64

In [99]:
df['two']

a    0.605265
b    1.532221
c    0.780580
Name: two, dtype: float64

In [100]:
row = df.iloc[1]
col = df['two']

In [101]:
df.sub(row, axis='columns')

        one       two     three
a -0.318149 -0.926956       NaN
b  0.000000  0.000000  0.000000
c       NaN -0.751640 -0.114536

In [102]:
df.sub(col, axis=0)

        one  two     three
a -0.890368  0.0       NaN
b -1.499174  0.0 -0.512682
c       NaN  0.0  0.124423

In [103]:
d = {'one': [1., 2., np.nan], 'two': [3., 2., 1.], 'three': [np.nan, 1., 1.]}
df = pd.DataFrame(d, index=list('abc'))
df

   one  two  three
a  1.0  3.0    NaN
b  2.0  2.0    1.0
c  NaN  1.0    1.0

In [104]:
d1 = {'one': pd.Series([1., 2.], index=['a', 'b']),
'two': pd.Series([1., 1., 1.], index=['a', 'b', 'c']),
'three': pd.Series([2., 2., 2.], index=['a', 'b', 'c'])}
df1 = pd.DataFrame(d1)
df1

   one  two  three
a  1.0  1.0    2.0
b  2.0  1.0    2.0
c  NaN  1.0    2.0

In [105]:
df + df1

   one  two  three
a  2.0  4.0    NaN
b  4.0  3.0    3.0
c  NaN  2.0    3.0

In [106]:
df.add(df1, fill_value=0)

   one  two  three
a  2.0  4.0    2.0
b  4.0  3.0    3.0
c  NaN  2.0    3.0

In [107]:
df = pd.DataFrame({'angles': [0, 3, 4], 'degrees': [360, 180, 360]},
index=['circle', 'triangle', 'rectangle'])
df
df+1
df - [1, 2]
df.sub([1, 2], axis='columns')
df1 = df.sub(pd.Series([1, 2, 3], index=['circle', 'triangle', 'rectangle']), axis='index')
df1
df

   one  two  three
a  1.0  3.0    NaN
b  2.0  2.0    1.0
c  NaN  1.0    1.0

In [108]:
df.mean(0)

one      1.5
two      2.0
three    1.0
dtype: float64

In [109]:
df.mean(1)

a    2.000000
b    1.666667
c    1.000000
dtype: float64

In [110]:
df.sum(0, skipna=False)

one      NaN
two      6.0
three    NaN
dtype: float64

In [111]:
df.sum(1, skipna=True)

a    4.0
b    5.0
c    2.0
dtype: float64

In [112]:
df.std()

one      0.707107
two      1.000000
three    0.000000
dtype: float64

In [113]:
df.std(axis=1)

a    1.414214
b    0.577350
c    0.000000
dtype: float64

In [114]:
np.std(df, axis=1)

a    1.000000
b    0.471405
c    0.000000
dtype: float64

In [115]:
np.std(df, ddof=1, axis=1)

a    1.414214
b    0.577350
c    0.000000
dtype: float64

In [116]:
df[['one', 'two', 'three']].std()

one      0.707107
two      1.000000
three    0.000000
dtype: float64

In [117]:
df.cumsum()

   one  two  three
a  1.0  3.0    NaN
b  3.0  5.0    1.0
c  NaN  6.0    2.0

In [118]:
np.mean(df['one'])

1.5

In [119]:
ser = pd.Series(np.random.randn(500))

In [120]:
ser[20:500] = np.nan
ser[10:20] = 5
ser.nunique()

11

In [121]:
ser = pd.Series(np.random.randn(1000))
ser[::2] = np.nan
ser.describe()

count    500.000000
mean      -0.025883
std        0.967017
min       -2.859892
25%       -0.712638
50%       -0.004027
75%        0.654425
max        2.678931
dtype: float64

In [122]:
df = pd.DataFrame(np.random.randn(1000, 4), columns=['a', 'b', 'c', 'd'])
df.iloc[::2] = np.nan
df.describe()

                a           b           c           d
count  500.000000  500.000000  500.000000  500.000000
mean     0.051854    0.059304    0.094345   -0.044210
std      1.016670    1.025659    0.986368    0.948177
min     -4.006729   -2.466983   -3.004304   -3.124887
25%     -0.685083   -0.607831   -0.511271   -0.616326
50%      0.047578    0.046677    0.046629   -0.059434
75%      0.751916    0.755081    0.689319    0.522909
max      2.785636    3.058291    3.395941    2.808580

In [123]:
ser.describe(percentiles=[0.05, 0.25, .75, .95])

count    500.000000
mean      -0.025883
std        0.967017
min       -2.859892
5%        -1.539012
25%       -0.712638
50%       -0.004027
75%        0.654425
95%        1.573196
max        2.678931
dtype: float64

In [124]:
ser = pd.Series(['a','a','b','c','c',np.nan, 'c', 'd'])
ser.describe()

count     7
unique    4
top       c
freq      3
dtype: object

In [125]:
df = pd.DataFrame({'a': ['Yes', 'Yes', 'No', 'No'], 'b': range(4)})
df.describe()

              b
count  4.000000
mean   1.500000
std    1.290994
min    0.000000
25%    0.750000
50%    1.500000
75%    2.250000
max    3.000000

In [126]:
df.describe(include=['object'])

          a
count     4
unique    2
top     Yes
freq      2

In [127]:
df.describe(include=['number'])

              b
count  4.000000
mean   1.500000
std    1.290994
min    0.000000
25%    0.750000
50%    1.500000
75%    2.250000
max    3.000000

In [128]:
df.describe(include='all')

          a         b
count     4  4.000000
unique    2       NaN
top     Yes       NaN
freq      2       NaN
mean    NaN  1.500000
std     NaN  1.290994
min     NaN  0.000000
25%     NaN  0.750000
50%     NaN  1.500000
75%     NaN  2.250000
max     NaN  3.000000

In [129]:
ser = pd.Series(np.random.randn(5))
ser

0   -0.201720
1    0.702317
2   -0.036248
3    0.410143
4   -0.446333
dtype: float64

In [130]:
ser.idxmin(), ser.idxmax()

(4, 1)

In [131]:
df = pd.DataFrame(np.random.randn(4, 3), columns=['A', 'B', 'C'])
df

          A         B         C
0  1.720478  0.775014  2.619620
1 -1.280321  0.686845 -1.300439
2  0.873629 -0.403519 -0.141074
3 -2.176719 -1.850905 -0.939048

In [132]:
df.idxmin(axis=0)

A    3
B    3
C    1
dtype: int64

In [133]:
df.idxmin()

A    3
B    3
C    1
dtype: int64

In [134]:
df.idxmax(axis=1)

0    C
1    B
2    A
3    C
dtype: object

In [135]:
df1 = pd.DataFrame([2, 1, 1, 3, np.nan], columns=['A'], index=list('edcba'))
df1

     A
e  2.0
d  1.0
c  1.0
b  3.0
a  NaN

In [136]:
df1['A'].idxmin()

'd'

In [137]:
data = np.random.randint(0, 7, size=30)
data

array([6, 2, 2, 4, 5, 1, 6, 0, 6, 0, 4, 3, 5, 5, 5, 4, 2, 0, 1, 0, 0, 5,
       4, 3, 4, 5, 0, 4, 1, 4])

In [138]:
ser1 = pd.Series(data)
ser1.value_counts()
pd.value_counts(data)

4    7
5    6
0    6
6    3
2    3
1    3
3    2
dtype: int64

In [139]:
pd.cut(np.array([1, 7, 5, 4, 6, 3]), 3)

[(0.994, 3.0], (5.0, 7.0], (3.0, 5.0], (3.0, 5.0], (5.0, 7.0], (0.994, 3.0]]
Categories (3, interval[float64]): [(0.994, 3.0] < (3.0, 5.0] < (5.0, 7.0]]

In [140]:
pd.cut(np.array([1, 7, 5, 4, 6, 3]), 3, retbins=True)

([(0.994, 3.0], (5.0, 7.0], (3.0, 5.0], (3.0, 5.0], (5.0, 7.0], (0.994, 3.0]]
 Categories (3, interval[float64]): [(0.994, 3.0] < (3.0, 5.0] < (5.0, 7.0]],
 array([0.994, 3.   , 5.   , 7.   ]))

In [141]:
pd.cut(np.array([1, 7, 5, 4, 6, 3]), 3, labels=['bad', 'medium', 'good'])

['bad', 'good', 'medium', 'medium', 'good', 'bad']
Categories (3, object): ['bad' < 'medium' < 'good']

In [142]:
pd.cut([0, 1, 1, 2], bins=4, labels=False)

array([0, 1, 1, 3], dtype=int64)

In [143]:
ser = pd.Series(np.array([2, 4, 6, 8, 10]), index=['a', 'b', 'c', 'd', 'e'])

In [144]:
pd.cut(ser, 3)

a    (1.992, 4.667]
b    (1.992, 4.667]
c    (4.667, 7.333]
d     (7.333, 10.0]
e     (7.333, 10.0]
dtype: category
Categories (3, interval[float64]): [(1.992, 4.667] < (4.667, 7.333] < (7.333, 10.0]]

In [145]:
pd.qcut(range(5), 4)

[(-0.001, 1.0], (-0.001, 1.0], (1.0, 2.0], (2.0, 3.0], (3.0, 4.0]]
Categories (4, interval[float64]): [(-0.001, 1.0] < (1.0, 2.0] < (2.0, 3.0] < (3.0, 4.0]]

In [146]:
pd.qcut(range(5), 3, labels=['good', 'medium', 'bad'])

['good', 'good', 'medium', 'bad', 'bad']
Categories (3, object): ['good' < 'medium' < 'bad']

In [147]:
pd.qcut(range(5), 4, labels=False)

array([0, 0, 1, 2, 3], dtype=int64)

In [148]:
pd.cut(np.random.randn(25), 5).value_counts()

(-2.283, -1.478]    3
(-1.478, -0.677]    6
(-0.677, 0.123]     6
(0.123, 0.924]      8
(0.924, 1.725]      2
dtype: int64

In [149]:
pd.qcut(np.random.randn(25), 5).value_counts()

(-2.2079999999999997, -0.925]    5
(-0.925, -0.0671]                5
(-0.0671, 0.289]                 5
(0.289, 0.657]                   5
(0.657, 1.418]                   5
dtype: int64

In [150]:
data = pd.DataFrame([[1, 1, 1], [2, 2, 2], [3, 3, 3]], index=['A', 'B', 'C'],
columns=['one', 'two', 'three'])
data

   one  two  three
A    1    1      1
B    2    2      2
C    3    3      3

In [151]:
def add(data, arg1):
    data1 = data + arg1
    return data1
def div(data1, arg2):
    data2 = data1/arg2
    return data2
def mul(data2, arg3):
    data3 = data2 * arg3
    return data3
def sub(data3, arg4):
    data4 = data3 - arg4
    return data4
(data.pipe(add, arg1=2) # data 2 
.pipe(div, arg2=3) # data 2   3 
.pipe(mul, arg3=5) #   3   5 
.pipe(sub, arg4=1)) #   1

        one       two     three
A  4.000000  4.000000  4.000000
B  5.666667  5.666667  5.666667
C  7.333333  7.333333  7.333333

In [152]:
df = pd.DataFrame()
df['name'] = ['jsun', 'jin', 'ujung', 'naeun', 'suho']
df['sex'] = ['female', 'male', 'female', 'female', 'male']
df['age'] = [84, 58, 53, 27, 18]
df

    name     sex  age
0   jsun  female   84
1    jin    male   58
2  ujung  female   53
3  naeun  female   27
4   suho    male   18

In [153]:
def mean_age_group(dataframe, col):
    return dataframe.groupby(col).mean()
def cap_column(dataframe):
    dataframe.columns = dataframe.columns.str.upper()
    return dataframe

In [154]:
(df.pipe(mean_age_group, col='sex')
.pipe(cap_column))

              AGE
sex
female  54.666667
male    38.000000

In [155]:
data = [{'one': 1.0, 'two': 1.2}, {'one': 0.5, 'two': 1.1, 'three': 0.7},
{'one': 0.7, 'two': 0.9, 'three': -1.6}, {'two': 1.4, 'three': -1.2}]
df = pd.DataFrame(data, index=list('abcd'))
df

   one  two  three
a  1.0  1.2    NaN
b  0.5  1.1    0.7
c  0.7  0.9   -1.6
d  NaN  1.4   -1.2

In [156]:
df.apply(np.mean)

one      0.733333
two      1.150000
three   -0.700000
dtype: float64

In [157]:
df.apply(np.mean, axis=1)

a    1.100000
b    0.766667
c    0.000000
d    0.100000
dtype: float64

In [158]:
df.apply(lambda x: x.max() - x.min())

one      0.5
two      0.5
three    2.3
dtype: float64

In [159]:
df.apply(np.cumsum)

   one  two  three
a  1.0  1.2    NaN
b  1.5  2.3    0.7
c  2.2  3.2   -0.9
d  NaN  4.6   -2.1

In [160]:
df.apply(np.exp)

        one       two     three
a  2.718282  3.320117       NaN
b  1.648721  3.004166  2.013753
c  2.013753  2.459603  0.201897
d       NaN  4.055200  0.301194

In [161]:
df.apply('mean')

one      0.733333
two      1.150000
three   -0.700000
dtype: float64

In [162]:
df.apply('mean', axis=1)

a    1.100000
b    0.766667
c    0.000000
d    0.100000
dtype: float64

In [ ]:
df = pd.DataFrame([[1, 2, 3],
[4, 5, 6],
[7, 8, 9],
[np.nan, np.nan, np.nan]], columns=['A', 'B', 'C'])
df
df.agg(['sum', 'min'])
df.agg({'A' : ['sum', 'min'], 'B' : ['min', 'max']})
df.agg("mean", axis="columns")

In [163]:
adf = pd.DataFrame(np.random.randn(6, 3), columns=['A','B','C'],
index=pd.date_range('7/1/2021', periods=6))

In [164]:
adf.iloc[2:4] = np.nan
adf

                   A         B         C
2021-07-01  0.483135 -0.464654  0.040032
2021-07-02 -0.663777  0.622539  1.752530
2021-07-03       NaN       NaN       NaN
2021-07-04       NaN       NaN       NaN
2021-07-05 -0.984351  1.075634 -0.602753
2021-07-06 -0.201708 -1.572522 -0.478173

In [165]:
adf.agg(np.sum)

A   -1.366700
B   -0.339003
C    0.711636
dtype: float64

In [166]:
adf.agg('sum')

A   -1.366700
B   -0.339003
C    0.711636
dtype: float64

In [167]:
adf.sum()

A   -1.366700
B   -0.339003
C    0.711636
dtype: float64

In [168]:
adf.A.agg('sum')

-1.366700316487332

In [169]:
adf.agg(['sum'])

          A         B         C
sum -1.3667 -0.339003  0.711636

In [170]:
adf.agg(['sum', 'mean'])

             A         B         C
sum  -1.366700 -0.339003  0.711636
mean -0.341675 -0.084751  0.177909

In [171]:
adf.A.agg(['sum', lambda x: x.mean()])

sum        -1.366700
<lambda>   -0.341675
Name: A, dtype: float64

In [172]:
def mymean(x):
    return x.mean()

adf.A.agg(['sum', mymean])

sum      -1.366700
mymean   -0.341675
Name: A, dtype: float64

In [173]:
adf.agg({'A': 'mean', 'B': 'sum'})

A   -0.341675
B   -0.339003
dtype: float64

In [174]:
adf.agg({'A': ['mean', 'min'], 'B': 'sum'})

             A         B
mean -0.341675       NaN
min  -0.984351       NaN
sum        NaN -0.339003

In [ ]:
df = pd.DataFrame({'A': range(3), 'B': range(1, 4)})

In [175]:
adf.transform(np.abs)

                   A         B         C
2021-07-01  0.483135  0.464654  0.040032
2021-07-02  0.663777  0.622539  1.752530
2021-07-03       NaN       NaN       NaN
2021-07-04       NaN       NaN       NaN
2021-07-05  0.984351  1.075634  0.602753
2021-07-06  0.201708  1.572522  0.478173

In [176]:
adf.A.transform(np.abs)

2021-07-01    0.483135
2021-07-02    0.663777
2021-07-03         NaN
2021-07-04         NaN
2021-07-05    0.984351
2021-07-06    0.201708
Freq: D, Name: A, dtype: float64

In [177]:
adf.transform([np.abs, lambda x: x + 1])

                   A                   B                   C
            absolute  <lambda>  absolute  <lambda>  absolute  <lambda>
2021-07-01  0.483135  1.483135  0.464654  0.535346  0.040032  1.040032
2021-07-02  0.663777  0.336223  0.622539  1.622539  1.752530  2.752530
2021-07-03       NaN       NaN       NaN       NaN       NaN       NaN
2021-07-04       NaN       NaN       NaN       NaN       NaN       NaN
2021-07-05  0.984351  0.015649  1.075634  2.075634  0.602753  0.397247
2021-07-06  0.201708  0.798292  1.572522 -0.572522  0.478173  0.521827

In [178]:
adf.A.transform([np.abs, lambda x: x + 1])

            absolute  <lambda>
2021-07-01  0.483135  1.483135
2021-07-02  0.663777  0.336223
2021-07-03       NaN       NaN
2021-07-04       NaN       NaN
2021-07-05  0.984351  0.015649
2021-07-06  0.201708  0.798292

In [179]:
adf.transform({'A': np.abs, 'B': lambda x: x + 1})

                   A         B
2021-07-01  0.483135  0.535346
2021-07-02  0.663777  1.622539
2021-07-03       NaN       NaN
2021-07-04       NaN       NaN
2021-07-05  0.984351  2.075634
2021-07-06  0.201708 -0.572522

In [180]:
adf.transform({'A': np.abs, 'B': [lambda x: x + 1, 'sqrt']})

C:\Users\HONG\anaconda3\lib\site-packages\pandas\core\series.py:726: RuntimeWarning: invalid value encountered in sqrt
  result = getattr(ufunc, method)(*inputs, **kwargs)

                   A         B
            absolute  <lambda>      sqrt
2021-07-01  0.483135  0.535346       NaN
2021-07-02  0.663777  1.622539  0.789012
2021-07-03       NaN       NaN       NaN
2021-07-04       NaN       NaN       NaN
2021-07-05  0.984351  2.075634  1.037128
2021-07-06  0.201708 -0.572522       NaN

In [181]:
df = pd.DataFrame([[1, 2.12], [3.356, 4.567]])
df

       0      1
0  1.000  2.120
1  3.356  4.567

In [182]:
df.applymap(lambda x: len(str(x)))

   0  1
0  3  4
1  5  5

In [183]:
df.applymap(lambda x: x**2)

           0          1
0   1.000000   4.494400
1  11.262736  20.857489

In [184]:
df ** 2

           0          1
0   1.000000   4.494400
1  11.262736  20.857489

In [185]:
ser = pd.Series(['cat', 'dog', np.nan, 'rabbit'])
ser

0       cat
1       dog
2       NaN
3    rabbit
dtype: object

In [186]:
ser.map({'cat': 'kitten', 'dog': 'puppy'})

0    kitten
1     puppy
2       NaN
3       NaN
dtype: object

In [187]:
ser.map('I am a {}'.format)

0       I am a cat
1       I am a dog
2       I am a nan
3    I am a rabbit
dtype: object

In [188]:
ser.map('I am a {}'.format, na_action='ignore')

0       I am a cat
1       I am a dog
2              NaN
3    I am a rabbit
dtype: object

In [189]:
df1 = pd.DataFrame(np.random.randn(5, 4), columns=list('ABCD'),
index=pd.date_range('20210701', periods=5))
df1

                   A         B         C         D
2021-07-01 -0.524846  0.185653 -1.166374  0.991508
2021-07-02 -1.427521  0.398024  0.223145  0.335193
2021-07-03 -1.213520 -0.614190  0.034336  0.662748
2021-07-04  0.432688 -0.352535 -1.766213  0.459002
2021-07-05  0.074163  1.129233 -1.349782  0.588014

In [190]:
df1.loc['20210702':'20210703']

                   A         B         C         D
2021-07-02 -1.427521  0.398024  0.223145  0.335193
2021-07-03 -1.213520 -0.614190  0.034336  0.662748

In [191]:
ser1 = pd.Series(np.random.randn(4), index=list('abcd'))
ser1

a   -1.413671
b    0.136665
c    1.520398
d   -0.408562
dtype: float64

In [192]:
ser1.loc['c':]

c    1.520398
d   -0.408562
dtype: float64

In [193]:
ser1.loc['b']

0.1366648525726898

In [194]:
ser1.loc['c':] = 0
ser1

a   -1.413671
b    0.136665
c    0.000000
d    0.000000
dtype: float64

In [195]:
df1 = pd.DataFrame(np.random.randn(5, 4), index=list('abcde'), columns=list('ABCD'))
df1

          A         B         C         D
a -1.892066  1.093842 -0.389955  1.146634
b  0.374786 -0.992391  0.944316  0.528259
c -0.869031  0.550556  0.587877  0.511641
d -0.239400 -0.511048 -0.231562  0.949280
e -0.679697 -1.314385 -1.287576 -0.600074

In [196]:
df1.loc[['a', 'b', 'd'], :]

          A         B         C         D
a -1.892066  1.093842 -0.389955  1.146634
b  0.374786 -0.992391  0.944316  0.528259
d -0.239400 -0.511048 -0.231562  0.949280

In [197]:
df1.loc['c':, 'A':'C']

          A         B         C
c -0.869031  0.550556  0.587877
d -0.239400 -0.511048 -0.231562
e -0.679697 -1.314385 -1.287576

In [198]:
df1.loc['a']

A   -1.892066
B    1.093842
C   -0.389955
D    1.146634
Name: a, dtype: float64

In [199]:
ser = pd.Series(list('abcde'), index=[0, 3, 2, 5, 4])
ser

0    a
3    b
2    c
5    d
4    e
dtype: object

In [200]:
ser.loc[3:5]

3    b
2    c
5    d
dtype: object

In [201]:
ser.sort_index()

0    a
2    c
3    b
4    e
5    d
dtype: object

In [202]:
ser.sort_index().loc[1:6]

2    c
3    b
4    e
5    d
dtype: object

In [203]:
ser1 = pd.Series(np.random.randn(5), index=list(range(0, 10, 2)))
ser1

0   -1.058447
2    0.157270
4   -0.821298
6   -0.432927
8   -0.937127
dtype: float64

In [204]:
ser1.iloc[:3]

0   -1.058447
2    0.157270
4   -0.821298
dtype: float64

In [205]:
ser1.iloc[3]

-0.4329271060148354

In [206]:
df1 = pd.DataFrame( np.random.randn(5, 4), index=list(range(0, 10, 2)),
columns=list(range(0, 8, 2)))
df1

          0         2         4         6
0 -0.958493 -0.588519 -0.274708  0.031265
2  0.087331  0.190744  0.487980 -0.596437
4 -0.178229 -0.028932  0.667267  0.414360
6  0.035945 -0.782341 -0.553934 -0.684415
8  0.303719 -0.286138  0.326047 -0.274953

In [207]:
df1.iloc[:2]

          0         2         4         6
0 -0.958493 -0.588519 -0.274708  0.031265
2  0.087331  0.190744  0.487980 -0.596437

In [208]:
df1.iloc[1:3, 0:3]

          0         2         4
2  0.087331  0.190744  0.487980
4 -0.178229 -0.028932  0.667267

In [209]:
df1.iloc[[0, 2, 3], [1, 3]]

          2         6
0 -0.588519  0.031265
4 -0.028932  0.414360
6 -0.782341 -0.684415

In [210]:
df1.iloc[1]

0    0.087331
2    0.190744
4    0.487980
6   -0.596437
Name: 2, dtype: float64

In [211]:
df1 = pd.DataFrame(np.random.randn(5, 4), index=list('abcde'), columns=list('ABCD'))
df1

          A         B         C         D
a -0.964580 -1.142675  1.104248 -1.803831
b  0.786939 -0.218394 -2.782687  0.116504
c  0.351728 -0.693599  1.600629 -0.777265
d  2.155382 -0.896430  0.110466 -1.030414
e  0.338592 -0.309232 -0.309803 -0.630078

In [212]:
df1.loc[lambda df: df.A>0, :]

          A         B         C         D
b  0.786939 -0.218394 -2.782687  0.116504
c  0.351728 -0.693599  1.600629 -0.777265
d  2.155382 -0.896430  0.110466 -1.030414
e  0.338592 -0.309232 -0.309803 -0.630078

In [213]:
df1.loc[:, lambda df: ['A', 'B']]

          A         B
a -0.964580 -1.142675
b  0.786939 -0.218394
c  0.351728 -0.693599
d  2.155382 -0.896430
e  0.338592 -0.309232

In [214]:
df1.iloc[:, lambda df: [0, 1]]

          A         B
a -0.964580 -1.142675
b  0.786939 -0.218394
c  0.351728 -0.693599
d  2.155382 -0.896430
e  0.338592 -0.309232

In [215]:
df1[lambda df: df.columns[0]]

a   -0.964580
b    0.786939
c    0.351728
d    2.155382
e    0.338592
Name: A, dtype: float64

In [216]:
df1.A.loc[lambda ser: ser > 0]

b    0.786939
c    0.351728
d    2.155382
e    0.338592
Name: A, dtype: float64

In [217]:
ser = pd.Series(np.arange(3))
ser

0    0
1    1
2    2
dtype: int32

In [218]:
ser[5] = 7
ser

0    0
1    1
2    2
5    7
dtype: int64

In [219]:
df = pd.DataFrame(np.arange(9).reshape(3, 3), columns=['A', 'B', 'C'])
df

   A  B  C
0  0  1  2
1  3  4  5
2  6  7  8

In [220]:
df.loc[:, 'D'] = df.loc[:, 'A']

In [221]:
df

   A  B  C  D
0  0  1  2  0
1  3  4  5  3
2  6  7  8  6

In [222]:
df.loc[3] = 7
df

   A  B  C  D
0  0  1  2  0
1  3  4  5  3
2  6  7  8  6
3  7  7  7  7

In [223]:
ser.iat[3]
ser.at[5]
df.at[3, 'E'] = 7
df.iat[3, 0] = 2
df

   A  B  C  D    E
0  0  1  2  0  NaN
1  3  4  5  3  NaN
2  6  7  8  6  NaN
3  2  7  7  7  7.0

In [224]:
ser = pd.Series(range(-3, 3))
ser

0   -3
1   -2
2   -1
3    0
4    1
5    2
dtype: int64

In [225]:
ser[ser > 0]

4    1
5    2
dtype: int64

In [226]:
ser[(ser < -1) | (ser > 1)]

0   -3
1   -2
5    2
dtype: int64

In [227]:
ser[~(ser < 2)]

5    2
dtype: int64

In [228]:
df[df['A'] < 3]

   A  B  C  D    E
0  0  1  2  0  NaN
3  2  7  7  7  7.0

In [229]:
ser[::-1].isin([-3, -1, 2])

5     True
4    False
3    False
2     True
1    False
0     True
dtype: bool

In [230]:
ser[ser[::-1].isin([-3, -1, 2])]

0   -3
2   -1
5    2
dtype: int64

In [231]:
ser.index.isin([2, 4, 6])

array([False, False,  True, False,  True, False])

In [232]:
ser[ser.index.isin([2, 4, 6])]

2   -1
4    1
dtype: int64

In [233]:
df = pd.DataFrame({'no': [1, 2, 3], 'ha': ['a', 'b', 'c'], 'hi': ['m', 'n', 'o']})
val = ['a', 'n', 1, 3]
df

   no ha hi
0   1  a  m
1   2  b  n
2   3  c  o

In [234]:
df.isin(val)

      no     ha     hi
0   True   True  False
1  False  False   True
2   True  False  False

In [235]:
val = {'ha': ['a', 'c'], 'no': [1, 2]}
df.isin(val)

      no     ha     hi
0   True   True  False
1   True  False  False
2  False   True  False

In [236]:
val = {'ha': ['a', 'c'], 'hi': ['m', 'o'], 'no': [1, 2]}
mask = df.isin(val).all(1)

In [237]:
df[mask]

   no ha hi
0   1  a  m

In [238]:
index = pd.Index(np.random.randint(0, 1000, 6))
index

Int64Index([702, 485, 470, 493, 220, 442], dtype='int64')

In [239]:
positions = [0, 2, 5]
index[positions]

Int64Index([702, 470, 442], dtype='int64')

In [240]:
index.take(positions)

Int64Index([702, 470, 442], dtype='int64')

In [241]:
ser = pd.Series(np.random.randn(10))
ser.iloc[positions]

0   -1.800911
2    1.351300
5    1.461708
dtype: float64

In [242]:
ser.take(positions)

0   -1.800911
2    1.351300
5    1.461708
dtype: float64

In [243]:
df = pd.DataFrame(np.random.randn(5, 3))
df.take([1, 4, 3])

          0         1         2
1 -0.383912 -1.395507 -0.347213
4 -0.154255  0.612329  1.006430
3 -0.867623 -0.985242 -1.134114

In [244]:
df.take([0, 2], axis=1)

          0         2
0  2.097273 -0.998531
1 -0.383912 -0.347213
2 -0.309686  0.106538
3 -0.867623 -1.134114
4 -0.154255  1.006430

In [245]:
d = {'one': [1.5, 2.2, -3.0], 'two': [1.0, -1.2, 5.0], 'three': [-1.1, 2.0, 4.0]}
df = pd.DataFrame(d, index = ['a', 'c', 'f'])
df['four'] = 'ha'
df['five'] = df['one'] > 0
df

   one  two  three four   five
a  1.5  1.0   -1.1   ha   True
c  2.2 -1.2    2.0   ha   True
f -3.0  5.0    4.0   ha  False

In [246]:
df1 = df.reindex(['a', 'b', 'c', 'd', 'e', 'f'])
df1

   one  two  three four   five
a  1.5  1.0   -1.1   ha   True
b  NaN  NaN    NaN  NaN    NaN
c  2.2 -1.2    2.0   ha   True
d  NaN  NaN    NaN  NaN    NaN
e  NaN  NaN    NaN  NaN    NaN
f -3.0  5.0    4.0   ha  False

In [247]:
df1['one']

a    1.5
b    NaN
c    2.2
d    NaN
e    NaN
f   -3.0
Name: one, dtype: float64

In [248]:
pd.isna(df1['one'])

a    False
b     True
c    False
d     True
e     True
f    False
Name: one, dtype: bool

In [249]:
df1['four'].notna()

a     True
b    False
c     True
d    False
e    False
f     True
Name: four, dtype: bool

In [250]:
None == None

True

In [251]:
np.nan == np.nan

False

In [252]:
d1 = {'one': [1.0, 2.0, 3.0], 'two': [4.0, 5.0, 6.0]}

In [253]:
df1 = pd.DataFrame(d1, index = ['a', 'b', 'c'])
df2 = df1.copy()
df2.loc['d'] = np.nan
df2['three'] = 2.0
df2.iloc[1:2, 1:2] = np.nan
df1

   one  two
a  1.0  4.0
b  2.0  5.0
c  3.0  6.0

In [254]:
df2

   one  two  three
a  1.0  4.0    2.0
b  2.0  NaN    2.0
c  3.0  6.0    2.0
d  NaN  NaN    2.0

In [255]:
df1 + df2

   one  three   two
a  2.0    NaN   8.0
b  4.0    NaN   NaN
c  6.0    NaN  12.0
d  NaN    NaN   NaN

In [256]:
pd.Series([np.nan]).sum()

0.0

In [257]:
pd.Series([], dtype=object).sum()

0

In [258]:
pd.Series([np.nan]).prod()

1.0

In [259]:
pd.Series([], dtype=object).prod()

1

In [260]:
df2

   one  two  three
a  1.0  4.0    2.0
b  2.0  NaN    2.0
c  3.0  6.0    2.0
d  NaN  NaN    2.0

In [261]:
df2.groupby('two').mean()

     one  three
two
4.0  1.0    2.0
6.0  3.0    2.0

In [262]:
df2.fillna(0)

   one  two  three
a  1.0  4.0    2.0
b  2.0  0.0    2.0
c  3.0  6.0    2.0
d  0.0  0.0    2.0

In [263]:
df2['one'].fillna('missing')

a          1
b          2
c          3
d    missing
Name: one, dtype: object

In [264]:
df2

   one  two  three
a  1.0  4.0    2.0
b  2.0  NaN    2.0
c  3.0  6.0    2.0
d  NaN  NaN    2.0

In [265]:
df2.fillna(method='pad')

   one  two  three
a  1.0  4.0    2.0
b  2.0  4.0    2.0
c  3.0  6.0    2.0
d  3.0  6.0    2.0

In [266]:
df2.loc['c', 'three'] = np.nan
df2

   one  two  three
a  1.0  4.0    2.0
b  2.0  NaN    2.0
c  3.0  6.0    NaN
d  NaN  NaN    2.0

In [267]:
df2.mean()

one      2.0
two      5.0
three    2.0
dtype: float64

In [268]:
df2.fillna(df2.mean())

   one  two  three
a  1.0  4.0    2.0
b  2.0  5.0    2.0
c  3.0  6.0    2.0
d  2.0  5.0    2.0

In [ ]:
df = pd.DataFrame([ [np.nan, 2, 0, np.nan], [3, 4, np.nan, 1], [np.nan, 5, np.nan, 2],
[np.nan, 1, 2, 3]], columns=list('ABCD'))
df
df.fillna(0)
df.fillna(method='ffill')
val = {'A': 0, 'B': 1, 'C': 2, 'D': 3}
df.fillna(value=val)
df.fillna(value=val, limit=1)

In [269]:
df2.iloc[2:3, 2:3] = 2.0
df2

   one  two  three
a  1.0  4.0    2.0
b  2.0  NaN    2.0
c  3.0  6.0    2.0
d  NaN  NaN    2.0

In [270]:
df2.dropna(axis=0)

   one  two  three
a  1.0  4.0    2.0
c  3.0  6.0    2.0

In [271]:
df2.dropna(axis=1)

   three
a    2.0
b    2.0
c    2.0
d    2.0

In [272]:
df2['two'].dropna()

a    4.0
c    6.0
Name: two, dtype: float64

In [ ]:
df = pd.DataFrame({'name': ['haena', 'suho', 'naeun'],
'hobby': ['jogging', 'reading', np.nan],
'born': [pd.NaT, pd.Timestamp('2001-01-01'), pd.NaT]})
df
df.dropna()
df.dropna(axis='columns')
df.drpopna(how='all')
df.dropna(thresh=2)
df.dropna(subset=['name', 'born'])
df.dropna(subset=['hobby'])
df.dropna(inplace=True)
df

In [273]:
ser = pd.Series([0, np.nan, 2, 3, 5])
ser

0    0.0
1    NaN
2    2.0
3    3.0
4    5.0
dtype: float64

In [274]:
ser.replace(np.nan, 1.0)

0    0.0
1    1.0
2    2.0
3    3.0
4    5.0
dtype: float64

In [275]:
ser.replace({np.nan: 1, 5: 4})

0    0.0
1    1.0
2    2.0
3    3.0
4    4.0
dtype: float64

In [276]:
ser.replace([0, 2], 1)

0    1.0
1    NaN
2    1.0
3    3.0
4    5.0
dtype: float64

In [277]:
ser.replace([np.nan, 5], [1, np.nan])

0    0.0
1    1.0
2    2.0
3    3.0
4    NaN
dtype: float64

In [278]:
df = pd.DataFrame({'A': [0, 1, np.nan], 'B': [3, 4, 5]})
df.replace({'A': np.nan, 'B': 3}, 10)

      A   B
0   0.0  10
1   1.0   4
2  10.0   5

In [279]:
######################################### 4.3.4.

li = [['ha', 'ha', 'hi', 'hi', 'ho', 'ho'], ['one', 'two', 'one', 'two', 'one', 'two']]
li1 = list(zip(*li))
li1

[('ha', 'one'),
 ('ha', 'two'),
 ('hi', 'one'),
 ('hi', 'two'),
 ('ho', 'one'),
 ('ho', 'two')]

In [280]:
ind = pd.MultiIndex.from_tuples(li1, names=['1st', '2nd'])
ind

MultiIndex([('ha', 'one'),
            ('ha', 'two'),
            ('hi', 'one'),
            ('hi', 'two'),
            ('ho', 'one'),
            ('ho', 'two')],
           names=['1st', '2nd'])

In [281]:
ser = pd.Series(np.random.randn(6), index=ind)
ser

1st  2nd
ha   one   -0.339264
     two   -0.615008
hi   one   -0.269377
     two    0.187064
ho   one   -0.652559
     two    0.178951
dtype: float64

In [282]:
iter = [['ha', 'hi', 'ho'], ['one', 'two']]
pd.MultiIndex.from_product(iter, names=['1st', '2nd'])

MultiIndex([('ha', 'one'),
            ('ha', 'two'),
            ('hi', 'one'),
            ('hi', 'two'),
            ('ho', 'one'),
            ('ho', 'two')],
           names=['1st', '2nd'])

In [283]:
df = pd.DataFrame([['ha', 'one'], ['ha', 'two'], ['ho', 'one'], ['ho', 'two']],
columns=['1st', '2nd'])
pd.MultiIndex.from_frame(df)

MultiIndex([('ha', 'one'),
            ('ha', 'two'),
            ('ho', 'one'),
            ('ho', 'two')],
           names=['1st', '2nd'])

In [284]:
arr = [ np.array(['ha', 'ha', 'hi', 'hi', 'ho', 'ho']), np.array(['one', 'two', 'one',
'two', 'one', 'two'])]
ser = pd.Series(np.random.randn(6), index=arr)
ser

ha  one    1.338737
    two    1.077762
hi  one    1.539513
    two   -0.106579
ho  one   -1.090840
    two    0.370244
dtype: float64

In [285]:
df = pd.DataFrame(np.random.randn(6, 3), index=arr)
df

               0         1         2
ha one  0.650021  0.349582 -0.855820
   two -1.101569 -0.276073  1.517586
hi one  0.376528  0.211025 -0.864834
   two -0.446479 -0.196813 -2.008206
ho one  0.272920 -0.146606 -0.949356
   two  1.864464  0.672100  0.680391

In [286]:
df = pd.DataFrame(np.random.randn(3, 6), index=['A', 'B', 'C'], columns=ind)
df

1st        ha                  hi                  ho
2nd       one       two       one       two       one       two
A    1.588027 -1.258368 -0.097677  0.002880  0.769906 -0.791949
B   -2.613225 -1.097652  1.599259 -0.319328 -1.237801  1.710869
C   -1.317432  0.636064 -1.461880 -0.765002  1.195946  0.103484

In [287]:
df['ha']

2nd       one       two
A    1.588027 -1.258368
B   -2.613225 -1.097652
C   -1.317432  0.636064

In [288]:
df['ha']['one']

A    1.588027
B   -2.613225
C   -1.317432
Name: one, dtype: float64

In [289]:
ser.reindex(ind[:3])

1st  2nd
ha   one    1.338737
     two    1.077762
hi   one    1.539513
dtype: float64

In [290]:
ser.reindex([('ho', 'one'), ('ha', 'two')])

ho  one   -1.090840
ha  two    1.077762
dtype: float64

In [291]:
df = df.T
df

                A         B         C
1st 2nd
ha  one  1.588027 -2.613225 -1.317432
    two -1.258368 -1.097652  0.636064
hi  one -0.097677  1.599259 -1.461880
    two  0.002880 -0.319328 -0.765002
ho  one  0.769906 -1.237801  1.195946
    two -0.791949  1.710869  0.103484

In [292]:
df.loc[('ha', 'two')]

A   -1.258368
B   -1.097652
C    0.636064
Name: (ha, two), dtype: float64

In [293]:
df.loc[('ha', 'two'), 'A']
df.loc['ha']

            A         B         C
2nd
one  1.588027 -2.613225 -1.317432
two -1.258368 -1.097652  0.636064

In [294]:
df.loc['ha':'hi']

                A         B         C
1st 2nd
ha  one  1.588027 -2.613225 -1.317432
    two -1.258368 -1.097652  0.636064
hi  one -0.097677  1.599259 -1.461880
    two  0.002880 -0.319328 -0.765002

In [295]:
df.loc[('hi', 'two'):('ho', 'one')]

                A         B         C
1st 2nd
hi  two  0.002880 -0.319328 -0.765002
ho  one  0.769906 -1.237801  1.195946

In [296]:
df.loc[('hi', 'two'):'ho']

                A         B         C
1st 2nd
hi  two  0.002880 -0.319328 -0.765002
ho  one  0.769906 -1.237801  1.195946
    two -0.791949  1.710869  0.103484

In [297]:
df.loc[[('ha', 'two'), ('ho', 'one')]]

                A         B         C
1st 2nd
ha  two -1.258368 -1.097652  0.636064
ho  one  0.769906 -1.237801  1.195946

In [298]:
li1

[('ha', 'one'),
 ('ha', 'two'),
 ('hi', 'one'),
 ('hi', 'two'),
 ('ho', 'one'),
 ('ho', 'two')]

In [299]:
np.random.shuffle(li1)
li1

[('ho', 'one'),
 ('ha', 'two'),
 ('ho', 'two'),
 ('hi', 'one'),
 ('ha', 'one'),
 ('hi', 'two')]

In [300]:
ser = pd.Series(np.random.randn(6), index=pd.MultiIndex.from_tuples(li1))
ser

ho  one    1.249362
ha  two    0.409203
ho  two    1.100604
hi  one   -0.441275
ha  one    0.384636
hi  two    2.083151
dtype: float64

In [301]:
ser.sort_index()

ha  one    0.384636
    two    0.409203
hi  one   -0.441275
    two    2.083151
ho  one    1.249362
    two    1.100604
dtype: float64

In [302]:
ser.sort_index(level=0)

ha  one    0.384636
    two    0.409203
hi  one   -0.441275
    two    2.083151
ho  one    1.249362
    two    1.100604
dtype: float64

In [303]:
ser.sort_index(level=1)

ha  one    0.384636
hi  one   -0.441275
ho  one    1.249362
ha  two    0.409203
hi  two    2.083151
ho  two    1.100604
dtype: float64

In [304]:
ser.index.set_names(['1st', '2nd'], inplace=True)
ser.sort_index(level='1st')

1st  2nd
ha   one    0.384636
     two    0.409203
hi   one   -0.441275
     two    2.083151
ho   one    1.249362
     two    1.100604
dtype: float64

In [305]:
ser.sort_index(level='2nd')

1st  2nd
ha   one    0.384636
hi   one   -0.441275
ho   one    1.249362
ha   two    0.409203
hi   two    2.083151
ho   two    1.100604
dtype: float64

In [306]:
df

                A         B         C
1st 2nd
ha  one  1.588027 -2.613225 -1.317432
    two -1.258368 -1.097652  0.636064
hi  one -0.097677  1.599259 -1.461880
    two  0.002880 -0.319328 -0.765002
ho  one  0.769906 -1.237801  1.195946
    two -0.791949  1.710869  0.103484

In [307]:
df.T.sort_index(level=1, axis=1)

1st        ha        hi        ho        ha        hi        ho
2nd       one       one       one       two       two       two
A    1.588027 -0.097677  0.769906 -1.258368  0.002880 -0.791949
B   -2.613225  1.599259 -1.237801 -1.097652 -0.319328  1.710869
C   -1.317432 -1.461880  1.195946  0.636064 -0.765002  0.103484

In [308]:
###############################################################################


# 4.4.1 ##
###

In [309]:
data = {'name': ['haena', 'naeun', 'una', 'bum', 'suho'],
'age': [30, 27, 28, 23, 18],'address': ['dogok', 'suwon', 'mapo', 'ilsan', 'yeoyi'],
'grade': ['A', 'B', 'C', 'B', 'A'],
'score': [100, 88, 73, 83, 95]}
df = pd.DataFrame(data, columns=['name', 'age', 'address', 'score', 'grade'])
df

    name  age address  score grade
0  haena   30   dogok    100     A
1  naeun   27   suwon     88     B
2    una   28    mapo     73     C
3    bum   23   ilsan     83     B
4   suho   18   yeoyi     95     A

In [310]:
df.to_csv('student_grade.csv')

In [311]:
!type student_grade.csv

,name,age,address,score,grade
0,haena,30,dogok,100,A
1,naeun,27,suwon,88,B
2,una,28,mapo,73,C
3,bum,23,ilsan,83,B
4,suho,18,yeoyi,95,A

In [312]:
df1=pd.read_csv('student_grade.csv')
df1

   Unnamed: 0   name  age address  score grade
0           0  haena   30   dogok    100     A
1           1  naeun   27   suwon     88     B
2           2    una   28    mapo     73     C
3           3    bum   23   ilsan     83     B
4           4   suho   18   yeoyi     95     A

In [313]:
df1 = df1.iloc[0:5, 1:6]
df1

    name  age address  score grade
0  haena   30   dogok    100     A
1  naeun   27   suwon     88     B
2    una   28    mapo     73     C
3    bum   23   ilsan     83     B
4   suho   18   yeoyi     95     A

In [314]:
df.to_csv('student_grade.csv')
df2 = pd.read_csv('student_grade.csv', header=None, nrows=3)
df2

     0      1    2        3      4      5
0  NaN   name  age  address  score  grade
1  0.0  haena   30    dogok    100      A
2  1.0  naeun   27    suwon     88      B

In [315]:
df2 = pd.read_csv('student_grade.csv', index_col=0)
df2

    name  age address  score grade
0  haena   30   dogok    100     A
1  naeun   27   suwon     88     B
2    una   28    mapo     73     C
3    bum   23   ilsan     83     B
4   suho   18   yeoyi     95     A

In [316]:
df2 = pd.read_csv('student_grade.csv', index_col=['name'])
df2

       Unnamed: 0  age address  score grade
name
haena           0   30   dogok    100     A
naeun           1   27   suwon     88     B
una             2   28    mapo     73     C
bum             3   23   ilsan     83     B
suho            4   18   yeoyi     95     A

In [317]:
df2 = pd.read_csv('student_grade.csv', names=['No', 'name', 'age', 'address', 'score',
'grade'], nrows=3)
df2

    No   name  age  address  score  grade
0  NaN   name  age  address  score  grade
1  0.0  haena   30    dogok    100      A
2  1.0  naeun   27    suwon     88      B

In [318]:
to_na = {'address': ['mapo', 'NA'], 'score': [83]}
df2 = pd.read_csv('student_grade.csv', na_values=to_na)
df2

   Unnamed: 0   name  age address  score grade
0           0  haena   30   dogok  100.0     A
1           1  naeun   27   suwon   88.0     B
2           2    una   28     NaN   73.0     C
3           3    bum   23   ilsan    NaN     B
4           4   suho   18   yeoyi   95.0     A

In [319]:
df2 = pd.read_csv('student_grade.csv', skiprows=3)
df2

   2   una  28   mapo  73  C
0  3   bum  23  ilsan  83  B
1  4  suho  18  yeoyi  95  A

In [320]:
!type student_grade1.csv

name|age|address|score|grade
haena|30|dogok|100|A
naeun|27|suwon|88|B
una|28|mapo|73|C
bum|23|ilsan|83|B
suho|18|yeoyi|95|A

In [321]:
pd.read_csv('student_grade1.csv', sep='|')

    name  age address  score grade
0  haena   30   dogok    100     A
1  naeun   27   suwon     88     B
2    una   28    mapo     73     C
3    bum   23   ilsan     83     B
4   suho   18   yeoyi     95     A

In [322]:
dfj = pd.DataFrame([[ 'a', 'b'], ['c', 'd']], index=['row1', 'row2'], columns=['col1',
'col2'])
dfj.to_json()

'{"col1":{"row1":"a","row2":"c"},"col2":{"row1":"b","row2":"d"}}'

In [323]:
dfj.to_json(orient='split')

'{"columns":["col1","col2"],"index":["row1","row2"],"data":[["a","b"],["c","d"]]}'

In [324]:
dfj.to_json(orient='records')

'[{"col1":"a","col2":"b"},{"col1":"c","col2":"d"}]'

In [325]:
dfj.to_json(orient='index')

'{"row1":{"col1":"a","col2":"b"},"row2":{"col1":"c","col2":"d"}}'

In [326]:
dfj.to_json(orient='columns')

'{"col1":{"row1":"a","row2":"c"},"col2":{"row1":"b","row2":"d"}}'

In [327]:
dfj.to_json(orient='values')

'[["a","b"],["c","d"]]'

In [328]:
dfj.to_json(orient='table')

'{"schema":{"fields":[{"name":"index","type":"string"},{"name":"col1","type":"string"},{"name":"col2","type":"string"}],"primaryKey":["index"],"pandas_version":"0.20.0"},"data":[{"index":"row1","col1":"a","col2":"b"},{"index":"row2","col1":"c","col2":"d"}]}'

In [329]:
df = pd.DataFrame(data, columns=['name', 'age', 'address', 'score', 'grade'])
df.to_json('student_grade.json')

In [330]:
pd.read_json('student_grade.json')

    name  age address  score grade
0  haena   30   dogok    100     A
1  naeun   27   suwon     88     B
2    una   28    mapo     73     C
3    bum   23   ilsan     83     B
4   suho   18   yeoyi     95     A

In [331]:
df = pd.DataFrame({'ha': [1, 2, 3, 4],
'hi': ['a', 'b', 'c', 'd'],
'ho': pd.date_range('2021-09-01', freq='d', periods=4),
                   'hu': pd.Categorical(['a', 'b', 'c', 'd'])},
index=pd.Index(range(4), name='ind'));df

     ha hi         ho hu
ind
0     1  a 2021-09-01  a
1     2  b 2021-09-02  b
2     3  c 2021-09-03  c
3     4  d 2021-09-04  d

In [332]:
df.dtypes

ha             int64
hi            object
ho    datetime64[ns]
hu          category
dtype: object

In [333]:
df.to_json('hello.json', orient='table')
dfj = pd.read_json('hello.json', orient='table')
dfj

     ha hi         ho hu
ind
0     1  a 2021-09-01  a
1     2  b 2021-09-02  b
2     3  c 2021-09-03  c
3     4  d 2021-09-04  d

In [334]:
dfj.dtypes

ha             int64
hi            object
ho    datetime64[ns]
hu          category
dtype: object

In [335]:
url = 'https://finance.yahoo.com/quote/NNOX/profile?p=NNOX'
dfh = pd.read_html(url)
dfh

[                             Name                     Title  Pay  Exercised  \
 0               Mr. Ran Poliakine   Founder, Chairman & CEO  NaN        NaN
 1               Mr. Itzhak Maayan   Chief Financial Officer  NaN        NaN
 2               Mr. James M. Dara   Chief Operating Officer  NaN        NaN
 3                  Mr. Ofir Koren  Chief Technology Officer  NaN        NaN
 4                   Mr. Tal Shank        VP of Corp. Devel.  NaN        NaN
 5                 Ms. Anat Kaphan   VP of Product Marketing  NaN        NaN
 6          Ms. Tamar Aharon Cohen   Chief Marketing Officer  NaN        NaN
 7  Ms. Shirly Kaufman-Kirshenbaum                  VP of HR  NaN        NaN
 8                  Mr. Gilad Yron        Chief Bus. Officer  NaN        NaN
 9               Ms. Lydia Edwards          Pres of Nanox US  NaN        NaN

    Year Born
 0     1968.0
 1     1966.0
 2     1970.0
 3     1970.0
 4     1978.0
 5     1970.0
 6     1977.0
 7     1975.0
 8     1973.0
 9        NaN  ]

In [336]:
df = pd.DataFrame(np.random.randn(2, 2))
df

          0         1
0  1.098443 -3.070569
1  0.206129  0.921344

In [337]:
print(df.to_html())

<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>0</th>
      <th>1</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>1.098443</td>
      <td>-3.070569</td>
    </tr>
    <tr>
      <th>1</th>
      <td>0.206129</td>
      <td>0.921344</td>
    </tr>
  </tbody>
</table>

In [338]:
df = pd.DataFrame([[1, 2, 3], [4, 5, 6]], columns=['A', 'B', 'C'])
df.to_clipboard(sep=',', index=False)
pd.read_clipboard()

   A,B,C
0  1,2,3
1  4,5,6

In [339]:
df1 = pd.read_excel('shoppingcenter.xlsx')
df2 = pd.read_excel('shoppingcenter.xlsx')
df = pd.read_excel('shoppingcenter.xlsx')
df

                             1  1~2  2~3  3~5  5
0             //      //   1.0   2.0  42.0  39.0   16.0
1             //         /   0.0   6.0  18.0  35.0   44.0
2             //  PC///   0.0   5.0  12.0  86.0   20.0
3             //    //   0.0   1.0   1.0   1.0    2.0
4             //        /   0.0   0.0   1.0   0.0    0.0
...        ...   ...       ...           ...   ...   ...   ...   ...    ...
20620         /     -   5.0   1.0   1.0   0.0   22.0
20621         /     -   6.0   2.0   3.0  47.0   18.0
20622         /             8.0   1.0  17.0  53.0   28.0
20623         /             0.0   1.0   7.0   5.0  115.0
20624         /           0.0   1.0   0.0   0.0    3.0

[20625 rows x 9 columns]

In [340]:
df1 = pd.read_excel('shoppingcenter.xlsx', sheet_name='2018  ')
df1

                             1  1~2  2~3  3~5  5
0             //      //     1     1    16    64     19
1             //         /     0     0    13    45     46
2             //  PC///     0     3     9    68     43
3             //    //     0     1     2     0      3
4             //        /     0     0     1     0      0
...        ...   ...       ...           ...   ...   ...   ...   ...    ...
20620         /     -     2     3     1     1     22
20621         /     -     3     4     3    47     18
20622         /               4     4     6    64     28
20623         /               0     0     3     9    115
20624         /             0     0     1     0      3

[20625 rows x 9 columns]

In [341]:
df.to_excel('file_with_path.xlsx', sheet_name='Sheet1')

In [342]:
hfs = pd.HDFStore('store.h5')
hfs

<class 'pandas.io.pytables.HDFStore'>
File path: store.h5

In [343]:
ind = pd.date_range('1/1/2021', periods=8)
ser = pd.Series(np.random.randn(5), index=['a', 'b', 'c', 'd', 'e'])
df = pd.DataFrame(np.random.randn(8, 3), index=ind, columns=['A', 'B', 'C'])
country = ['KOR', 'US', 'ITALY']
mind = pd.MultiIndex.from_product([country, ind])
col = ["item_%d" % i for i in range(1, 4)]
data = np.random.randn(24, 3)

In [344]:
df1 = pd.DataFrame(data, index=mind, columns=col)
df1

                    item_1    item_2    item_3
KOR   2021-01-01  0.386394 -0.977768 -1.993946
      2021-01-02 -0.199890 -0.243835  0.337446
      2021-01-03  0.009669  2.778919 -0.134262
      2021-01-04  0.482102  0.159601 -0.350513
      2021-01-05  0.646647  2.084110 -0.215803
      2021-01-06 -1.624177 -1.189844 -1.365084
      2021-01-07 -1.364114  0.373186 -0.097014
      2021-01-08  1.044384  1.811946  0.029790
US    2021-01-01 -0.062190 -0.262360 -0.000571
      2021-01-02 -0.429171 -0.114710 -1.153265
      2021-01-03 -1.218656 -0.145268  0.264741
      2021-01-04 -0.484658 -0.555228  0.733940
      2021-01-05  1.616793  1.340243  1.080457
      2021-01-06 -0.128360  0.729443 -1.260550
      2021-01-07  0.797177  0.440391  1.373812
      2021-01-08  0.850749 -0.894942  1.473970
ITALY 2021-01-01  0.197334  0.432338 -1.918287
      2021-01-02  0.191009  1.422963 -0.561193
      2021-01-03 -0.184083 -1.416717  1.073875
      2021-01-04 -1.070875  0.564523 -0.867180
      2021-01-05 -0.149492  0.259927 -0.511999
      2021-01-06  0.482862 -1.116533  0.588076
      2021-01-07  1.276762 -0.140561 -0.664897
      2021-01-08  0.925617 -0.373417 -0.353251

In [345]:
hfs['ser'] = ser
hfs['df'] = df
hfs['df1'] = df1
hfs

<class 'pandas.io.pytables.HDFStore'>
File path: store.h5

In [346]:
hfs['df']

                   A         B         C
2021-01-01 -2.194225  1.334529  1.079093
2021-01-02 -1.240425  0.607491  1.107732
2021-01-03 -1.845978  1.199316  0.230913
2021-01-04 -0.573740 -0.970969  0.504786
2021-01-05  0.467870  1.713269 -1.246676
2021-01-06  1.256595 -0.912099 -0.682193
2021-01-07 -0.002263 -1.743175 -1.043452
2021-01-08 -0.655988 -0.127559 -0.572072

In [347]:
del hfs['df1']

In [348]:
#hfs['df1']

In [349]:
hfs.close()

In [350]:
#hfs['ser']
#hfs.df

In [351]:
df_s = pd.DataFrame({'A': list(range(5)), 'B': list(range(5))})
df_s.to_hdf('hfs_s.h5', 'table', append=True)
pd.read_hdf('hfs_s.h5', 'table', where=['index>2'])

   A  B
3  3  3
4  4  4
3  3  3
4  4  4

In [352]:
#from sqlalchemy import create_engine
#engine = create_engine('postgresql://scott:tiger@localhost:5432/mydb')
# sqlite://<nohostname>/<path>
# where <path> is relative:
#engine = create_engine('sqlite:///jin.db')
#engine = create_engine('sqlite://')
#engine = create_engine('sqlite:///:memory:')

In [359]:
from sqlalchemy import create_engine
engine = create_engine('sqlite:///:memory:')

In [360]:
df2  = pd.read_csv('student_grade.csv', index_col=0) 
df2.to_sql('data_db', engine)
df2.to_sql('data_db1', engine, chunksize=1000)

In [361]:
pd.read_sql_table('data_db', engine)

   index   name  age address  score grade
0      0  haena   30   dogok    100     A
1      1  naeun   27   suwon     88     B
2      2    una   28    mapo     73     C
3      3    bum   23   ilsan     83     B
4      4   suho   18   yeoyi     95     A

In [362]:
pd.read_sql_table('data_db', engine, index_col='name')

       index  age address  score grade
name
haena      0   30   dogok    100     A
naeun      1   27   suwon     88     B
una        2   28    mapo     73     C
bum        3   23   ilsan     83     B
suho       4   18   yeoyi     95     A

In [363]:
pd.read_sql_table('data_db', engine, columns=['name', 'grade'])

    name grade
0  haena     A
1  naeun     B
2    una     C
3    bum     B
4   suho     A

In [364]:
pd.read_sql_query('SELECT * FROM data_db', engine)

   index   name  age address  score grade
0      0  haena   30   dogok    100     A
1      1  naeun   27   suwon     88     B
2      2    una   28    mapo     73     C
3      3    bum   23   ilsan     83     B
4      4   suho   18   yeoyi     95     A

In [365]:
pd.read_sql_query("SELECT name, address FROM data_db WHERE grade='A';", engine)

    name address
0  haena   dogok
1   suho   yeoyi

In [366]:
dfc = pd.DataFrame(np.random.randn(9, 3), columns=list('abc'))
dfc.to_sql('data_ck', engine, index=False)
for chunk in pd.read_sql_query("SELECT * FROM data_ck", engine, chunksize=3):
    print(chunk)

          a         b         c
0 -0.733973 -0.919681 -0.116925
1  0.351232 -0.376313 -0.983268
2 -0.199314 -1.068167 -0.264015
          a         b         c
0  0.230098  0.676113 -0.046839
1  0.129894  0.307725  0.971459
2  1.460186  1.152541 -0.906164
          a         b         c
0  1.872970  0.699920 -1.106343
1  0.545566  1.396238 -1.129041
2 -0.451837  0.448178 -0.203647

In [367]:
df = pd.read_csv('air_test.csv')
df

        site_code  test_no  average
0             104        1    0.008
1             102        8  101.000
2             102        9   64.000
3             102        6    0.071
4             102        1    0.005
...           ...      ...      ...
291595        116        3    0.021
291596        116        8   19.000
291597        124        6    0.014
291598        110        9   11.000
291599        116        6    0.025

[291600 rows x 3 columns]

In [372]:
df_chunk = pd.read_csv('air_test.csv', chunksize=10000)
df_chunk

In [369]:
#for chunk in df_chunk:
#    print(chunk)

      site_code  test_no  average
0           104        1    0.008
1           102        8  101.000
2           102        9   64.000
3           102        6    0.071
4           102        1    0.005
...         ...      ...      ...
9995        107        3    0.065
9996        125        9   98.000
9997        125        8  137.000
9998        125        6    0.029
9999        125        5    0.900

[10000 rows x 3 columns]
       site_code  test_no  average
10000        125        1    0.005
10001        125        3    0.050
10002        109        9   84.000
10003        109        8  114.000
10004        109        6    0.026
...          ...      ...      ...
19995        106        6    0.005
19996        106        5    0.800
19997        106        1    0.005
19998        106        3    0.058
19999        110        9   38.000

[10000 rows x 3 columns]
       site_code  test_no  average
20000        110        8   51.000
20001        110        6    0.005
20002        110        5    0.700
20003        110        1    0.008
20004        110        3    0.037
...          ...      ...      ...
29995        102        5    0.900
29996        102        3    0.059
29997        102        1    0.006
29998        102        6    0.011
29999        102        9   41.000

[10000 rows x 3 columns]
       site_code  test_no  average
30000        117        8   71.000
30001        122        9   36.000
30002        122        8   50.000
30003        122        6    0.005
30004        122        5    0.700
...          ...      ...      ...
39995        107        3    0.058
39996        125        9   65.000
39997        125        8   73.000
39998        125        6    0.022
39999        125        5    0.800

[10000 rows x 3 columns]
       site_code  test_no  average
40000        125        1    0.006
40001        125        3    0.046
40002        109        9   63.000
40003        109        8   73.000
40004        109        6    0.025
...          ...      ...      ...
49995        102        8   42.000
49996        122        9   24.000
49997        122        8   43.000
49998        122        6    0.005
49999        122        5    0.300

[10000 rows x 3 columns]
       site_code  test_no  average
50000        122        1    0.004
50001        122        3    0.052
50002        105        9   33.000
50003        105        8   46.000
50004        105        6    0.007
...          ...      ...      ...
59995        117        9   32.000
59996        117        8   41.000
59997        117        6    0.035
59998        117        5    0.400
59999        117        1    0.004

[10000 rows x 3 columns]
       site_code  test_no  average
60000        118        9   33.000
60001        122        9   29.000
60002        122        8   34.000
60003        122        6    0.032
60004        122        5    0.400
...          ...      ...      ...
69995        102        3    0.049
69996        102        1    0.004
69997        102        6    0.005
69998        102        9   22.000
69999        102        8   40.000

[10000 rows x 3 columns]
       site_code  test_no  average
70000        122        9   17.000
70001        122        8   45.000
70002        122        6    0.006
70003        122        5    0.400
70004        122        1    0.005
...          ...      ...      ...
79995        101        6    0.015
79996        101        5    0.700
79997        101        1    0.004
79998        101        3    0.035
79999        104        9   23.000

[10000 rows x 3 columns]
       site_code  test_no  average
80000        104        8   46.000
80001        104        6    0.023
80002        104        5    0.800
80003        104        1    0.006
80004        104        3    0.021
...          ...      ...      ...
89995        102        5    0.400
89996        102        3    0.017
89997        102        1    0.002
89998        102        6    0.032
89999        102        9   11.000

[10000 rows x 3 columns]
       site_code  test_no  average
90000        115        9   17.000
90001        101        9   15.000
90002        101        8   28.000
90003        101        6    0.029
90004        101        5    0.400
...          ...      ...      ...
99995        119        8   45.000
99996        119        6    0.068
99997        119        5    0.200
99998        119        1    0.004
99999        119        3    0.025

[10000 rows x 3 columns]
        site_code  test_no  average
100000        123        9   19.000
100001        123        8   33.000
100002        123        6    0.005
100003        123        5    0.500
100004        123        1    0.004
...           ...      ...      ...
109995        119        1    0.005
109996        119        3    0.037
109997        123        9   35.000
109998        123        8   40.000
109999        123        6    0.002

[10000 rows x 3 columns]
        site_code  test_no  average
110000        123        5    0.600
110001        123        1    0.007
110002        123        3    0.039
110003        124        9   30.000
110004        110        1    0.008
...           ...      ...      ...
119995        106        3    0.050
119996        115        8  110.000
119997        102        9   40.000
119998        115        9   64.000
119999        102        8   74.000

[10000 rows x 3 columns]
        site_code  test_no  average
120000        118        9   34.000
120001        122        9   36.000
120002        122        8   74.000
120003        122        6    0.003
120004        122        5    1.000
...           ...      ...      ...
129995        124        5    0.400
129996        123        3    0.015
129997        124        9   12.000
129998        124        8   31.000
129999        124        6    0.027

[10000 rows x 3 columns]
        site_code  test_no  average
130000        105        3    0.016
130001        123        9   26.000
130002        123        5    0.400
130003        101        5    0.500
130004        101        3    0.025
...           ...      ...      ...
139995        123        9   24.000
139996        119        5    0.600
139997        123        5    0.600
139998        123        6    0.002
139999        123        8   37.000

[10000 rows x 3 columns]
        site_code  test_no  average
140000        119        6    0.006
140001        124        8   42.000
140002        124        9   20.000
140003        124        6    0.002
140004        123        3    0.055
...           ...      ...      ...
149995        113        6    0.002
149996        113        8   56.000
149997        113        5    1.200
149998        113        9   23.000
149999        109        9   23.000

[10000 rows x 3 columns]
        site_code  test_no  average
150000        110        5    0.700
150001        120        3    0.052
150002        104        1    0.005
150003        104        3    0.040
150004        117        3    0.050
...           ...      ...      ...
159995        104        5    1.300
159996        104        6    0.004
159997        124        5    1.300
159998        107        6    0.002
159999        107        8  107.000

[10000 rows x 3 columns]
        site_code  test_no  average
160000        107        5    1.100
160001        107        9   78.000
160002        107        3    0.057
160003        104        3    0.052
160004        107        1    0.005
...           ...      ...      ...
169995        105        8   47.000
169996        101        1    0.004
169997        111        5    0.600
169998        105        5    0.600
169999        101        5    0.500

[10000 rows x 3 columns]
        site_code  test_no  average
170000        121        3    0.023
170001        105        6    0.018
170002        108        9   18.000
170003        117        6    0.022
170004        117        8   29.000
...           ...      ...      ...
179995        105        6    0.022
179996        109        6    0.026
179997        112        8  147.000
179998        114        5    1.100
179999        114        3    0.043

[10000 rows x 3 columns]
        site_code  test_no  average
180000        106        6    0.025
180001        125        9   68.000
180002        101        6    0.034
180003        119        1    0.004
180004        119        3    0.038
...           ...      ...      ...
189995        109        1    0.007
189996        112        6    0.002
189997        109        3    0.050
189998        112        1    0.004
189999        112        5    0.800

[10000 rows x 3 columns]
        site_code  test_no  average
190000        112        3    0.042
190001        109        8   54.000
190002        109        6    0.002
190003        109        5    0.900
190004        109        9   43.000
...           ...      ...      ...
199995        102        9   17.000
199996        115        5    0.500
199997        120        5    0.400
199998        119        9   19.000
199999        120        9   21.000

[10000 rows x 3 columns]
        site_code  test_no  average
200000        119        6    0.015
200001        119        1    0.005
200002        108        3    0.022
200003        119        8   25.000
200004        123        9   18.000
...           ...      ...      ...
209995        101        6    0.019
209996        122        9   23.000
209997        105        3    0.021
209998        104        8   63.000
209999        104        9   37.000

[10000 rows x 3 columns]
        site_code  test_no  average
210000        102        8   56.000
210001        102        9   33.000
210002        102        6    0.015
210003        102        1    0.005
210004        102        3    0.032
...           ...      ...      ...
219995        117        9   19.000
219996        118        8   44.000
219997        118        9   28.000
219998        118        6    0.019
219999        118        1    0.005

[10000 rows x 3 columns]
        site_code  test_no  average
220000        118        3    0.037
220001        118        5    0.500
220002        114        8   33.000
220003        114        9   22.000
220004        114        6    0.024
...           ...      ...      ...
229995        109        6    0.003
229996        109        8   29.000
229997        109        9   23.000
229998        113        3    0.040
229999        113        1    0.004

[10000 rows x 3 columns]
        site_code  test_no  average
230000        113        5    1.200
230001        113        6    0.003
230002        113        8   35.000
230003        113        9   23.000
230004        107        3    0.043
...           ...      ...      ...
239995        121        8   28.000
239996        122        5    0.200
239997        122        9    2.000
239998        122        6    0.021
239999        122        8   26.000

[10000 rows x 3 columns]
        site_code  test_no  average
240000        110        3    0.013
240001        110        1    0.006
240002        110        5    0.400
240003        110        6    0.018
240004        110        8   22.000
...           ...      ...      ...
249995        119        9   24.000
249996        116        3    0.057
249997        116        1    0.005
249998        116        8   32.000
249999        116        5    0.800

[10000 rows x 3 columns]
        site_code  test_no  average
250000        116        6    0.002
250001        116        9   17.000
250002        111        6    0.002
250003        111        5    0.800
250004        111        1    0.004
...           ...      ...      ...
259995        109        3    0.041
259996        109        1    0.011
259997        109        5    0.900
259998        109        6    0.019
259999        109        8   95.000

[10000 rows x 3 columns]
        site_code  test_no  average
260000        109        9   85.000
260001        103        3    0.045
260002        103        1    0.005
260003        103        5    0.800
260004        103        6    0.017
...           ...      ...      ...
269995        122        9   21.000
269996        105        1    0.015
269997        105        5    1.100
269998        108        8   54.000
269999        105        3    0.050

[10000 rows x 3 columns]
        site_code  test_no  average
270000        102        8   47.000
270001        102        9   27.000
270002        102        1    0.005
270003        102        6    0.002
270004        102        3    0.059
...           ...      ...      ...
279995        107        3    0.042
279996        107        5    0.500
279997        107        1    0.007
279998        107        6    0.002
279999        107        8   42.000

[10000 rows x 3 columns]
        site_code  test_no  average
280000        107        9   32.000
280001        103        3    0.052
280002        103        1    0.004
280003        103        5    0.800
280004        103        6    0.001
...           ...      ...      ...
289995        113        6    0.011
289996        113        8   19.000
289997        113        9   12.000
289998        109        3    0.020
289999        109        1    0.007

[10000 rows x 3 columns]
        site_code  test_no  average
290000        109        5    0.600
290001        109        6    0.017
290002        109        8   21.000
290003        109        9   13.000
290004        125        3    0.036
...           ...      ...      ...
291595        116        3    0.021
291596        116        8   19.000
291597        124        6    0.014
291598        110        9   11.000
291599        116        6    0.025

[1600 rows x 3 columns]

In [370]:
type(chunk)

pandas.core.frame.DataFrame

In [373]:
pd.concat(df_chunk, ignore_index=True)

        site_code  test_no  average
0             104        1    0.008
1             102        8  101.000
2             102        9   64.000
3             102        6    0.071
4             102        1    0.005
...           ...      ...      ...
291595        116        3    0.021
291596        116        8   19.000
291597        124        6    0.014
291598        110        9   11.000
291599        116        6    0.025

[291600 rows x 3 columns]